experiments/benchmark_webserver/results/keda_prometheus/experiment_run_1/vegeta.1.log
Requests      [total, rate, throughput]         12, 10.90, 10.69
Duration      [total, attack, wait]             1.122s, 1.101s, 21.774ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.578ms, 21.906ms, 21.672ms, 22.669ms, 23.761ms, 23.943ms, 23.943ms
Bytes In      [total, mean]                     36, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:12  
Error Set:
Requests      [total, rate, throughput]         22, 10.47, 10.37
Duration      [total, attack, wait]             2.122s, 2.101s, 21.64ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.564ms, 21.792ms, 21.665ms, 21.938ms, 22.851ms, 23.943ms, 23.943ms
Bytes In      [total, mean]                     66, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:22  
Error Set:
Requests      [total, rate, throughput]         32, 10.32, 10.25
Duration      [total, attack, wait]             3.122s, 3.101s, 21.685ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.534ms, 21.795ms, 21.676ms, 22.154ms, 22.352ms, 23.943ms, 23.943ms
Bytes In      [total, mean]                     96, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:32  
Error Set:
Requests      [total, rate, throughput]         42, 10.24, 10.19
Duration      [total, attack, wait]             4.122s, 4.101s, 21.654ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.429ms, 21.861ms, 21.679ms, 22.154ms, 22.996ms, 25.291ms, 25.291ms
Bytes In      [total, mean]                     126, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:42  
Error Set:
Requests      [total, rate, throughput]         52, 10.19, 10.15
Duration      [total, attack, wait]             5.122s, 5.101s, 21.629ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.429ms, 21.836ms, 21.686ms, 22.114ms, 22.352ms, 25.264ms, 25.291ms
Bytes In      [total, mean]                     156, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:52  
Error Set:
Requests      [total, rate, throughput]         62, 10.16, 10.13
Duration      [total, attack, wait]             6.122s, 6.101s, 21.72ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.429ms, 21.814ms, 21.686ms, 21.957ms, 22.283ms, 25.129ms, 25.291ms
Bytes In      [total, mean]                     186, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:62  
Error Set:
Requests      [total, rate, throughput]         72, 10.14, 10.11
Duration      [total, attack, wait]             7.122s, 7.101s, 21.661ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.429ms, 21.797ms, 21.686ms, 21.876ms, 22.218ms, 24.994ms, 25.291ms
Bytes In      [total, mean]                     216, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:72  
Error Set:
Requests      [total, rate, throughput]         82, 10.12, 10.10
Duration      [total, attack, wait]             8.122s, 8.101s, 21.832ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.429ms, 21.787ms, 21.684ms, 21.876ms, 22.165ms, 24.859ms, 25.291ms
Bytes In      [total, mean]                     246, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:82  
Error Set:
Requests      [total, rate, throughput]         92, 10.11, 10.09
Duration      [total, attack, wait]             9.122s, 9.101s, 21.62ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.429ms, 21.776ms, 21.684ms, 21.862ms, 22.121ms, 24.724ms, 25.291ms
Bytes In      [total, mean]                     276, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:92  
Error Set:
Requests      [total, rate, throughput]         102, 10.10, 10.08
Duration      [total, attack, wait]             10.122s, 10.101s, 21.809ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.429ms, 21.772ms, 21.686ms, 21.871ms, 22.115ms, 24.59ms, 25.291ms
Bytes In      [total, mean]                     306, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:102  
Error Set:
Requests      [total, rate, throughput]         112, 10.09, 10.07
Duration      [total, attack, wait]             11.122s, 11.101s, 21.579ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.429ms, 21.765ms, 21.686ms, 21.868ms, 22.089ms, 24.455ms, 25.291ms
Bytes In      [total, mean]                     336, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:112  
Error Set:
Requests      [total, rate, throughput]         122, 10.08, 10.06
Duration      [total, attack, wait]             12.122s, 12.101s, 21.578ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.429ms, 21.759ms, 21.686ms, 21.865ms, 21.986ms, 24.32ms, 25.291ms
Bytes In      [total, mean]                     366, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:122  
Error Set:
Requests      [total, rate, throughput]         132, 10.08, 10.06
Duration      [total, attack, wait]             13.122s, 13.1s, 21.935ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.429ms, 21.765ms, 21.691ms, 21.868ms, 22.092ms, 24.185ms, 25.291ms
Bytes In      [total, mean]                     396, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:132  
Error Set:
Requests      [total, rate, throughput]         142, 10.07, 10.06
Duration      [total, attack, wait]             14.122s, 14.101s, 21.481ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.755ms, 21.691ms, 21.865ms, 22.005ms, 24.051ms, 25.291ms
Bytes In      [total, mean]                     426, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:142  
Error Set:
Requests      [total, rate, throughput]         152, 10.07, 10.05
Duration      [total, attack, wait]             15.122s, 15.101s, 21.58ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.751ms, 21.694ms, 21.861ms, 21.931ms, 23.916ms, 25.291ms
Bytes In      [total, mean]                     456, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:152  
Error Set:
Requests      [total, rate, throughput]         162, 10.06, 10.05
Duration      [total, attack, wait]             16.123s, 16.101s, 21.925ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.752ms, 21.697ms, 21.861ms, 21.929ms, 23.781ms, 25.291ms
Bytes In      [total, mean]                     486, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:162  
Error Set:
Requests      [total, rate, throughput]         172, 10.06, 10.05
Duration      [total, attack, wait]             17.122s, 17.101s, 21.759ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.748ms, 21.697ms, 21.861ms, 21.923ms, 23.646ms, 25.291ms
Bytes In      [total, mean]                     516, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:172  
Error Set:
Requests      [total, rate, throughput]         182, 10.05, 10.04
Duration      [total, attack, wait]             18.122s, 18.101s, 21.71ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.752ms, 21.701ms, 21.861ms, 21.929ms, 23.55ms, 25.291ms
Bytes In      [total, mean]                     546, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:182  
Error Set:
Requests      [total, rate, throughput]         192, 10.05, 10.04
Duration      [total, attack, wait]             19.121s, 19.1s, 21.719ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.752ms, 21.704ms, 21.861ms, 21.934ms, 23.427ms, 25.291ms
Bytes In      [total, mean]                     576, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:192  
Error Set:
Requests      [total, rate, throughput]         202, 10.05, 10.04
Duration      [total, attack, wait]             20.122s, 20.101s, 21.726ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.748ms, 21.704ms, 21.857ms, 21.929ms, 23.304ms, 25.291ms
Bytes In      [total, mean]                     606, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:202  
Error Set:
Requests      [total, rate, throughput]         212, 10.05, 10.04
Duration      [total, attack, wait]             21.122s, 21.1s, 21.977ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.747ms, 21.704ms, 21.857ms, 21.934ms, 23.181ms, 25.291ms
Bytes In      [total, mean]                     636, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:212  
Error Set:
Requests      [total, rate, throughput]         222, 10.04, 10.04
Duration      [total, attack, wait]             22.122s, 22.101s, 21.618ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.745ms, 21.703ms, 21.853ms, 21.929ms, 23.058ms, 25.291ms
Bytes In      [total, mean]                     666, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:222  
Error Set:
Requests      [total, rate, throughput]         232, 10.04, 10.03
Duration      [total, attack, wait]             23.122s, 23.101s, 21.659ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.744ms, 21.704ms, 21.856ms, 21.923ms, 22.936ms, 25.291ms
Bytes In      [total, mean]                     696, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:232  
Error Set:
Requests      [total, rate, throughput]         242, 10.04, 10.03
Duration      [total, attack, wait]             24.122s, 24.101s, 21.751ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.743ms, 21.704ms, 21.853ms, 21.915ms, 22.813ms, 25.291ms
Bytes In      [total, mean]                     726, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:242  
Error Set:
Requests      [total, rate, throughput]         252, 10.04, 10.03
Duration      [total, attack, wait]             25.122s, 25.101s, 21.776ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.741ms, 21.704ms, 21.85ms, 21.908ms, 22.712ms, 25.291ms
Bytes In      [total, mean]                     756, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:252  
Error Set:
Requests      [total, rate, throughput]         262, 10.04, 10.03
Duration      [total, attack, wait]             26.122s, 26.101s, 21.536ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.739ms, 21.704ms, 21.847ms, 21.906ms, 22.7ms, 25.291ms
Bytes In      [total, mean]                     786, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:262  
Error Set:
Requests      [total, rate, throughput]         272, 10.04, 10.03
Duration      [total, attack, wait]             27.122s, 27.101s, 21.606ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.741ms, 21.704ms, 21.853ms, 21.924ms, 22.688ms, 25.291ms
Bytes In      [total, mean]                     816, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:272  
Error Set:
Requests      [total, rate, throughput]         282, 10.04, 10.03
Duration      [total, attack, wait]             28.122s, 28.101s, 21.724ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.741ms, 21.704ms, 21.853ms, 21.929ms, 22.676ms, 25.291ms
Bytes In      [total, mean]                     846, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:282  
Error Set:
Requests      [total, rate, throughput]         292, 10.03, 10.03
Duration      [total, attack, wait]             29.122s, 29.101s, 21.656ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.739ms, 21.704ms, 21.853ms, 21.937ms, 22.664ms, 25.291ms
Bytes In      [total, mean]                     876, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:292  
Error Set:
Requests      [total, rate, throughput]         302, 10.03, 10.03
Duration      [total, attack, wait]             30.122s, 30.101s, 21.63ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.738ms, 21.704ms, 21.85ms, 21.929ms, 22.652ms, 25.291ms
Bytes In      [total, mean]                     906, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:302  
Error Set:
Requests      [total, rate, throughput]         312, 10.03, 10.02
Duration      [total, attack, wait]             31.122s, 31.101s, 21.704ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.737ms, 21.703ms, 21.847ms, 21.925ms, 22.64ms, 25.291ms
Bytes In      [total, mean]                     936, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:312  
Error Set:
Requests      [total, rate, throughput]         322, 10.03, 10.02
Duration      [total, attack, wait]             32.122s, 32.101s, 21.805ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.736ms, 21.703ms, 21.846ms, 21.921ms, 22.629ms, 25.291ms
Bytes In      [total, mean]                     966, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:322  
Error Set:
Requests      [total, rate, throughput]         332, 10.03, 10.02
Duration      [total, attack, wait]             33.122s, 33.101s, 21.721ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.735ms, 21.703ms, 21.846ms, 21.917ms, 22.617ms, 25.291ms
Bytes In      [total, mean]                     996, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:332  
Error Set:
Requests      [total, rate, throughput]         342, 10.03, 10.02
Duration      [total, attack, wait]             34.122s, 34.101s, 21.663ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.734ms, 21.703ms, 21.844ms, 21.913ms, 22.605ms, 25.291ms
Bytes In      [total, mean]                     1026, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:342  
Error Set:
Requests      [total, rate, throughput]         352, 10.03, 10.02
Duration      [total, attack, wait]             35.122s, 35.101s, 21.632ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.734ms, 21.703ms, 21.844ms, 21.909ms, 22.593ms, 25.291ms
Bytes In      [total, mean]                     1056, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:352  
Error Set:
Requests      [total, rate, throughput]         362, 10.03, 10.02
Duration      [total, attack, wait]             36.122s, 36.101s, 21.745ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.172ms, 21.733ms, 21.703ms, 21.844ms, 21.912ms, 22.583ms, 25.291ms
Bytes In      [total, mean]                     1086, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:362  
Error Set:
Requests      [total, rate, throughput]         372, 10.03, 10.02
Duration      [total, attack, wait]             37.122s, 37.1s, 21.824ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.734ms, 21.703ms, 21.846ms, 21.917ms, 22.586ms, 25.291ms
Bytes In      [total, mean]                     1116, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:372  
Error Set:
Requests      [total, rate, throughput]         382, 10.03, 10.02
Duration      [total, attack, wait]             38.124s, 38.101s, 23.628ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.738ms, 21.703ms, 21.847ms, 21.921ms, 22.676ms, 25.291ms
Bytes In      [total, mean]                     1146, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:382  
Error Set:
Requests      [total, rate, throughput]         392, 10.03, 10.02
Duration      [total, attack, wait]             39.122s, 39.101s, 21.706ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.738ms, 21.703ms, 21.846ms, 21.917ms, 22.664ms, 25.291ms
Bytes In      [total, mean]                     1176, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:392  
Error Set:
Requests      [total, rate, throughput]         402, 10.02, 10.02
Duration      [total, attack, wait]             40.122s, 40.101s, 21.636ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.736ms, 21.702ms, 21.844ms, 21.914ms, 22.652ms, 25.291ms
Bytes In      [total, mean]                     1206, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:402  
Error Set:
Requests      [total, rate, throughput]         412, 10.02, 10.02
Duration      [total, attack, wait]             41.122s, 41.101s, 21.663ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.735ms, 21.703ms, 21.842ms, 21.913ms, 22.64ms, 25.291ms
Bytes In      [total, mean]                     1236, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:412  
Error Set:
Requests      [total, rate, throughput]         422, 10.02, 10.02
Duration      [total, attack, wait]             42.122s, 42.101s, 21.609ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.734ms, 21.701ms, 21.841ms, 21.912ms, 22.629ms, 25.291ms
Bytes In      [total, mean]                     1266, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:422  
Error Set:
Requests      [total, rate, throughput]         432, 10.02, 10.02
Duration      [total, attack, wait]             43.122s, 43.1s, 21.786ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.733ms, 21.701ms, 21.839ms, 21.907ms, 22.617ms, 25.291ms
Bytes In      [total, mean]                     1296, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:432  
Error Set:
Requests      [total, rate, throughput]         442, 10.02, 10.02
Duration      [total, attack, wait]             44.122s, 44.101s, 21.617ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.733ms, 21.702ms, 21.838ms, 21.904ms, 22.605ms, 25.291ms
Bytes In      [total, mean]                     1326, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:442  
Error Set:
Requests      [total, rate, throughput]         452, 10.02, 10.02
Duration      [total, attack, wait]             45.122s, 45.101s, 21.785ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.732ms, 21.702ms, 21.836ms, 21.901ms, 22.594ms, 25.291ms
Bytes In      [total, mean]                     1356, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:452  
Error Set:
Requests      [total, rate, throughput]         462, 10.02, 10.02
Duration      [total, attack, wait]             46.122s, 46.101s, 21.733ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.732ms, 21.702ms, 21.837ms, 21.896ms, 22.59ms, 25.291ms
Bytes In      [total, mean]                     1386, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:462  
Error Set:
Requests      [total, rate, throughput]         472, 10.02, 10.02
Duration      [total, attack, wait]             47.122s, 47.101s, 21.598ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.731ms, 21.702ms, 21.835ms, 21.891ms, 22.586ms, 25.291ms
Bytes In      [total, mean]                     1416, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:472  
Error Set:
Requests      [total, rate, throughput]         482, 10.02, 10.02
Duration      [total, attack, wait]             48.122s, 48.101s, 21.609ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.73ms, 21.702ms, 21.835ms, 21.888ms, 22.582ms, 25.291ms
Bytes In      [total, mean]                     1446, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:482  
Error Set:
Requests      [total, rate, throughput]         492, 10.02, 10.02
Duration      [total, attack, wait]             49.122s, 49.101s, 21.703ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.729ms, 21.701ms, 21.835ms, 21.893ms, 22.578ms, 25.291ms
Bytes In      [total, mean]                     1476, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:492  
Error Set:
Requests      [total, rate, throughput]         502, 10.02, 10.02
Duration      [total, attack, wait]             50.122s, 50.101s, 21.637ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.729ms, 21.701ms, 21.834ms, 21.888ms, 22.574ms, 25.291ms
Bytes In      [total, mean]                     1506, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:502  
Error Set:
Requests      [total, rate, throughput]         512, 10.02, 10.02
Duration      [total, attack, wait]             51.122s, 51.101s, 21.716ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.728ms, 21.701ms, 21.833ms, 21.884ms, 22.57ms, 25.291ms
Bytes In      [total, mean]                     1536, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:512  
Error Set:
Requests      [total, rate, throughput]         522, 10.02, 10.01
Duration      [total, attack, wait]             52.122s, 52.101s, 21.692ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.728ms, 21.7ms, 21.833ms, 21.879ms, 22.566ms, 25.291ms
Bytes In      [total, mean]                     1566, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:522  
Error Set:
Requests      [total, rate, throughput]         532, 10.02, 10.01
Duration      [total, attack, wait]             53.122s, 53.101s, 21.779ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.727ms, 21.701ms, 21.833ms, 21.876ms, 22.562ms, 25.291ms
Bytes In      [total, mean]                     1596, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:532  
Error Set:
Requests      [total, rate, throughput]         542, 10.02, 10.01
Duration      [total, attack, wait]             54.122s, 54.101s, 21.828ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.727ms, 21.7ms, 21.832ms, 21.875ms, 22.558ms, 25.291ms
Bytes In      [total, mean]                     1626, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:542  
Error Set:
Requests      [total, rate, throughput]         552, 10.02, 10.01
Duration      [total, attack, wait]             55.123s, 55.101s, 22.628ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.728ms, 21.701ms, 21.832ms, 21.876ms, 22.594ms, 25.291ms
Bytes In      [total, mean]                     1656, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:552  
Error Set:
Requests      [total, rate, throughput]         562, 10.02, 10.01
Duration      [total, attack, wait]             56.122s, 56.101s, 21.67ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.727ms, 21.701ms, 21.832ms, 21.875ms, 22.59ms, 25.291ms
Bytes In      [total, mean]                     1686, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:562  
Error Set:
Requests      [total, rate, throughput]         572, 10.02, 10.01
Duration      [total, attack, wait]             57.122s, 57.101s, 21.766ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.727ms, 21.7ms, 21.832ms, 21.876ms, 22.586ms, 25.291ms
Bytes In      [total, mean]                     1716, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:572  
Error Set:
Requests      [total, rate, throughput]         582, 10.02, 10.01
Duration      [total, attack, wait]             58.122s, 58.101s, 21.708ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.727ms, 21.7ms, 21.832ms, 21.879ms, 22.582ms, 25.291ms
Bytes In      [total, mean]                     1746, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:582  
Error Set:
Requests      [total, rate, throughput]         592, 10.02, 10.01
Duration      [total, attack, wait]             59.122s, 59.101s, 21.546ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.726ms, 21.7ms, 21.832ms, 21.884ms, 22.575ms, 25.291ms
Bytes In      [total, mean]                     1776, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:592  
Error Set:
Requests      [total, rate, throughput]         600, 10.02, 10.01
Duration      [total, attack, wait]             59.922s, 59.901s, 21.488ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.108ms, 21.726ms, 21.7ms, 21.832ms, 21.889ms, 22.571ms, 25.291ms
Bytes In      [total, mean]                     1800, 3.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set: